# IsCyclical Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..IsCyclical Property
DividedPath Class See Also
---
True if the first and last point coincide False otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsCyclical { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCyclical As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCyclical {
	bool get ();
}
```

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace